#!/bin/bash

# ***************************************************************************
# * 
# * @file:grep_group.sh 
# * @author:nanjingrjb@gmail.com 
# * @date:2024-11-16 06:29 
# * @version 1.0  
# * @description: Shell script 
# * @Copyright (c)  all right reserved 
#* 
#**************************************************************************/ 



#采用分组来匹配
#
echo "匹配至少连续3个重复的数字"
echo 1233344487657888566645|grep -o  -E '([0-9])\1{2,}'
echo "匹配至少连续3个重复的数字,且数字连续"
echo 1233344487657888566699945|grep -o -E '([0-9])\1{2,}([0-9])\2{2,}'
echo 12333444887657888566699945|grep -o -E '([0-9])\1{2,}([0-9])\2{2,}([0-9])\3{1}'

echo "2023-10-05" | sed -E 's/([0-9]+)-([0-9]+)-([0-9]+)/\1 \2 \3/'


echo "匹配aaabbbcc模式的数字"
echo 12333444887657888566699945|grep -o -E '([0-9])\1{2,}([0-9])\2{2,}[0-9]{2}'|while read i; do p=${i: -2:2}; echo $p|grep -q -E '([0-9])\1{1}'&&echo $i;  done
